<h1>Chapter 5: Getting Started with Pandas<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#5.1-Introduction-to-pandas-Data-Structures" data-toc-modified-id="5.1-Introduction-to-pandas-Data-Structures-1">5.1 Introduction to pandas Data Structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-1.1">Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-1.2">DataFrame</a></span></li><li><span><a href="#Index-Objects" data-toc-modified-id="Index-Objects-1.3">Index Objects</a></span></li></ul></li><li><span><a href="#5.2-Essential-Functionality" data-toc-modified-id="5.2-Essential-Functionality-2">5.2 Essential Functionality</a></span><ul class="toc-item"><li><span><a href="#Reindexing" data-toc-modified-id="Reindexing-2.1">Reindexing</a></span></li><li><span><a href="#Dropping-Entries-from-an-Axis" data-toc-modified-id="Dropping-Entries-from-an-Axis-2.2">Dropping Entries from an Axis</a></span></li><li><span><a href="#Indexing,-Selection,-and-Filtering" data-toc-modified-id="Indexing,-Selection,-and-Filtering-2.3">Indexing, Selection, and Filtering</a></span><ul class="toc-item"><li><span><a href="#Selection-on-DataFrame-with-loc-and-iloc" data-toc-modified-id="Selection-on-DataFrame-with-loc-and-iloc-2.3.1">Selection on DataFrame with loc and iloc</a></span></li><li><span><a href="#Integer-indexing-pitfalls" data-toc-modified-id="Integer-indexing-pitfalls-2.3.2">Integer indexing pitfalls</a></span></li><li><span><a href="#Pitfalls-with-chained-indexing`" data-toc-modified-id="Pitfalls-with-chained-indexing`-2.3.3">Pitfalls with chained indexing`</a></span></li></ul></li><li><span><a href="#Arithmetic-and-Data-Alignment" data-toc-modified-id="Arithmetic-and-Data-Alignment-2.4">Arithmetic and Data Alignment</a></span><ul class="toc-item"><li><span><a href="#Arithmetic-methods-with-fill-values" data-toc-modified-id="Arithmetic-methods-with-fill-values-2.4.1">Arithmetic methods with fill values</a></span></li><li><span><a href="#Operations-between-DataFrame-and-Series" data-toc-modified-id="Operations-between-DataFrame-and-Series-2.4.2">Operations between DataFrame and Series</a></span></li></ul></li><li><span><a href="#Function-Application-and-Mapping" data-toc-modified-id="Function-Application-and-Mapping-2.5">Function Application and Mapping</a></span></li><li><span><a href="#Sorting-and-Ranking" data-toc-modified-id="Sorting-and-Ranking-2.6">Sorting and Ranking</a></span><ul class="toc-item"><li><span><a href="#Sorting" data-toc-modified-id="Sorting-2.6.1">Sorting</a></span></li><li><span><a href="#Ranking" data-toc-modified-id="Ranking-2.6.2">Ranking</a></span></li></ul></li><li><span><a href="#Axis-Indexes-with-Duplicate-Labels" data-toc-modified-id="Axis-Indexes-with-Duplicate-Labels-2.7">Axis Indexes with Duplicate Labels</a></span></li></ul></li><li><span><a href="#5.3-Summarizing-and-Computing-Descriptive-Statistics" data-toc-modified-id="5.3-Summarizing-and-Computing-Descriptive-Statistics-3">5.3 Summarizing and Computing Descriptive Statistics</a></span><ul class="toc-item"><li><span><a href="#Correlation-and-Covariance" data-toc-modified-id="Correlation-and-Covariance-3.1">Correlation and Covariance</a></span></li><li><span><a href="#Unique-Values,-Value-Counts,-and-Membership" data-toc-modified-id="Unique-Values,-Value-Counts,-and-Membership-3.2">Unique Values, Value Counts, and Membership</a></span></li></ul></li></ul></div>

In [1]:
# If you use Colab Notebook, you can uncomment the following to mount your Google Drive to Colab
# After that, your colab notebook can read/write files and data in your Google Drive

#from google.colab import drive
#drive.mount('/content/drive')

In [2]:
# If you use Colab Notebook, please change the current directory to be the folder that you save 
# your Notebook and data folder for example, I save my Colab files and data in the following location

#%cd /content/drive/MyDrive/Colab\ Notebooks

In [3]:
# import required libraries and modules, and define default setting for the notebook

import numpy as np
np.random.seed(12345)

import pandas as pd # https://pandas.pydata.org/  Check the documentation there
from pandas import Series, DataFrame # import modules into the local namespace if they are frequently used

import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 80
np.set_printoptions(precision=4, suppress=True)

# display all results in each cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## 5.1 Introduction to pandas Data Structures

pandas will be a major tool of interest throughout much of the rest of the book. It
contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and convenient in Python.

While pandas adopts many coding idioms from NumPy, the biggestabout difference
is that pandas is designed for working with tabular or heterogeneous data. NumPy, by
contrast, is best suited for working with homogeneously typed numerical array data.

### Series

A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) of the same type and an associated array of data labels,
called its index

In [4]:
# The Series shows the index on the left and the values on the right. 
# If the index object is not explicitly specififed, 0 to n-1 is used 
# where n is the number of elements in the Series

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# We can get the array representation of the Series via its array and index attributes
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [6]:
# # We can get the index object of the Series via its array and index attributes
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
# we can create a Series with an index identifying each data point with a label:

obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
print(obj2)

obj2.index

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# We can use labels in the index when selecting single values or a set of values

obj2["a"]

-5

In [9]:
obj2["d"] = 6

In [10]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [11]:
# filtering a Series with a Boolean array

obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
# scalar multiplication
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
# math functions
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
# a Series can be seen as a fixed-length, ordered dictionary, 
# as it is a mapping of index values to data values. 
# It can be used in many contexts where you might use a dictionary

"b" in obj2

True

In [15]:
"e" in obj2

False

In [16]:
# If we have data contained in a Python dictionary, we can create a Series from
# it by passing the dictionary:

sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
# convert the Series back to dictionary using the method to_dict()
# When we are only passing a dictionary, the index in the resulting Series will respect
# the order of the keys according to the dictionary’s keys method, which depends on
# the key insertion order:

obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
# We can override this by passing an index with the dictionary keys in the order 
# we want them to appear in the resulting Series:

states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4


# Here, three values found in sdata were placed in the appropriate locations, 
# but since no value for "California" was found, it appears as NaN (Not a Number), 
# which is considered in pandas to mark missing or NA values.
# Since "Utah" was not included in states, it is excluded from the resulting object

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
# The isna function in pandas is used to detect missing data

pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
# The notna function in pandas is used to detect non-missing (not an NA) data

pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
# Series also has these as instance methods

obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
# A useful Series feature is that it automatically aligns by index label in arithmetic operations

print(obj3,'\n')

print(obj4,'\n')

obj3 + obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
# Both the Series object itself and its index have a name attribute, 
# which integrates with other areas of pandas functionality:

obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [24]:
obj =pd.Series([4,7,-5,3])
print(obj,'\n')

# A Series’s index can be altered in place by assignment
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

A DataFrame represents a rectangular table of data and contains an ordered, named
collection of columns, each of which can be a different value type (numeric, string,
Boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dictionary of Series all sharing the same index.

In [25]:
# data is defined as a dictionary
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

# covert data into DataFrame using the function pandas.DataFrame()
frame = pd.DataFrame(data)

# The resulting DataFrame will have its index assigned automatically, as with Series,
# and the columns are placed according to the order of the keys in data
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
# the head method selects only the first five rows

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
# the tail method selects only the last five rows

frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
# If we specify a sequence of columns, the DataFrame’s columns will be arranged in that order

pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [29]:
# If we pass a column that isn’t contained in the dictionary, it will appear with missing
#values in the result:

frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
print(frame2,'\n'),
frame2.columns

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

(None,)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
# A column in a DataFrame can be retrieved as a Series by dictionary-like notation

frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [31]:
# A column in a DataFrame can also be retrieved as a Series by using the .attribute notation

frame2.year


#frame2[column] works for any column name, but frame2.column works only when the column name 
# is a valid Python variable name and does not conflict with any of the method names in DataFrame.
# For example, if a column’s name contains whitespace or symbols other than underscores, 
# it cannot be accessed with the dot attribute method.

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [32]:
print(frame2,'\n')

# Rows can also be retrieved by position or name with the special iloc and loc attributes

frame2.loc[1]

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [33]:
# Rows can also be retrieved by position or name with the special iloc and loc attributes
# iloc can only take integer arguments, whereas loc usually takes label indexing

frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [34]:
# Columns can be modified by assignment

frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [35]:
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [36]:
# When we assign lists or arrays to a column, the value’s length must match the length of the DataFrame. 
# If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, 
# inserting missing values in any index values not present

val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
print(val,'\n')

frame2["debt"] = val
frame2

# index of val has no overlap with the index of frame2. Therefore, elements of val are not assigned to frame2

two    -1.2
four   -1.5
five   -1.7
dtype: float64

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
print(val,'\n')

# indices of val have partial overlap with the indices of frame2. Therefore, the assignment 
# changes frame2

frame2["debt"] = val
frame2

2   -1.2
4   -1.5
5   -1.7
dtype: float64

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [38]:
# add a new column named "eastern", which is a new column of Boolean values where the state column equals "Ohio":

frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [39]:
# use the del method to delete a column

del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
# Another common form of data is a nested dictionary of dictionaries

populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

# If the nested dictionary is passed to the DataFrame, pandas will interpret the outer
# dictionary keys as the columns, and the inner keys as the row indices
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [41]:
# We can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array

frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [42]:
# The keys in the inner dictionaries are combined to form the index in the result. This
# isn’t true if an explicit index is specified. 

# In this example, an explicit index is specified

pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [43]:
# Dictionaries of Series are treated in much the same way

pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [44]:
# If a DataFrame’s index and columns have their name attributes set, these will also be displayed

frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [45]:
# Unlike Series, DataFrame does not have a name attribute. DataFrame’s to_numpy
# method returns the data contained in the DataFrame as a two-dimensional ndarray

frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [46]:
# If the DataFrame’s columns are different data types, the data type of the returned
# array will be chosen to accommodate all of the columns

frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

### Index Objects

Table 5-2. Some Index methods and properties

In [47]:
# pandas’s Index objects are responsible for holding the axis labels (including a DataFrame’s column names)
# and other metadata (like the axis name or names). 
# Any array or other sequence of labels you use when constructing a Series or DataFrame is
# internally converted to an Index

obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index = obj.index
print(index,'\n')
index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [48]:
# Index objects are immutable and thus can’t be modified by the user:

# index[1]='d'

In [49]:
# Immutability makes it safer to share Index objects among data structures

labels = pd.Index(np.arange(3))
print(labels,'\n')

obj2 = pd.Series([1.5, -2.5, 0], index=labels)
print(obj2)

obj2.index is labels

Index([0, 1, 2], dtype='int64')

0    1.5
1   -2.5
2    0.0
dtype: float64

True

In [50]:
# In addition to being array-like, an Index also behaves like a fixed-size set

print(frame3,'\n')

frame3.columns

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [51]:
"Ohio" in frame3.columns

True

In [52]:
2003 in frame3.index

False

In [53]:
# Unlike Python sets, a pandas Index can contain duplicate labels

pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 5.2 Essential Functionality

### Reindexing

reindex is a method to create a new object with the values rearranged to align with the new index

Table 5-3. reindex function arguments

In [54]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [55]:
# Calling reindex on this Series rearranges the data according to the new index,
# introducing missing values if any index values were not already present:

obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [56]:
# For ordered data like time series, we may want to do some interpolation or filling of
# values when reindexing.

obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
print(obj3,'\n')
obj3.reindex(np.arange(6), method="ffill") # choose 'ffill' - forward filling method during reindexing

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [57]:
# With DataFrame, reindex can alter the (row) index, columns, or both. 
# When passed only a sequence, it reindexes the rows in the result

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])

frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [58]:
# The columns can be reindexed with the columns keyword

states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

# Because "Ohio" was not in states, the data for that column is dropped from the result.
#

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [59]:
# Another way to reindex a particular axis is to pass the new axis labels as a positional
# argument and then specify the axis to reindex with the axis keyword

frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [60]:
# we can also reindex by using the loc operator, and many users prefer to always do it this way.
# works only if all of the new index labels already exist in the DataFrame (whereas reindex 
# will insert missing data for new labels):

frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

### Dropping Entries from an Axis

In [61]:
#Dropping one or more entries from an axis is simple if we already have an index array or list 

obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
print(obj,'\n')

# drop the row indexed as 'c', if any
new_obj = obj.drop("c")
print(new_obj,'\n')


# drop the rows indexed as 'c' or 'd', if any
print(obj.drop(["d", "c"]))

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [62]:
# With DataFrame, index values can be deleted from either axis. 
# To illustrate this, we first create an example DataFrame:
    
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0):

data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
#  Uue the columns keyword to drop labels from the columns

data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [65]:
# we can also drop values from the columns by passing axis=1 (which is like NumPy):

data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [66]:
# we can also drop values from the columns by passing axis="columns":

data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, Selection, and Filtering

Table 5-4. Indexing options with DataFrame

In [67]:
# Series indexing (obj[...]) works analogously to NumPy array indexing, 
# except we can use the Series’s index values instead of only integers

obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [68]:
obj["b"]

1.0

In [69]:
#obj[1]
# FutureWarning: Series.__getitem__ treating keys as positions is deprecated. 
# In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). 
# To access a value by position, use `ser.iloc[pos]`
# August 26, 2024
            
obj.iloc[1]

1.0

In [70]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [71]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [72]:
# obj[[1, 3]]
# FutureWarning: Series.__getitem__ treating keys as positions is deprecated. 
# In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). 
# To access a value by position, use `ser.iloc[pos]`
# August 26, 2024


obj.iloc[[1,3]]

b    1.0
d    3.0
dtype: float64

In [73]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [74]:
# While we can select data by label, the preferred way to select index values is
# with the special loc operator

obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [75]:
# The reason to prefer loc is because of the different treatment of integers when
# indexing with []. Regular []-based indexing will treat integers as labels if the index
# contains integers, so the behavior differs depending on the data type of the index.

obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj1

2    1
0    2
1    3
dtype: int64

In [76]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj2

a    1
b    2
c    3
dtype: int64

In [77]:
# The index contains integers, therefore, regular []-based indexing will treat integers as labels
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [78]:
# obj2[[0, 1, 2]]
# FutureWarning: Series.__getitem__ treating keys as positions is deprecated. 
# In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). 
# To access a value by position, use `ser.iloc[pos]`

obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [79]:
# When using loc, the expression obj.loc[[0, 1]] will fail when the index does not contain integers

#obj2.loc[[0, 1]]

In [80]:
# Since loc operator indexes exclusively with labels, there is also an iloc operator
# that indexes exclusively with integers to work consistently whether or not the index
# contains integers

obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [81]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [82]:
# We can also slice with labels, but it works differently from normal Python slicing 
# in that the endpoint is inclusive

obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [83]:
# Assigning values using these methods modifies the corresponding section of the Series:

obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [84]:
# Indexing into a DataFrame retrieves one or more columns either with a single value or sequence:

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [86]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [87]:
# slicing

data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [88]:
# selecting data with boolean array
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
#produce a boolean DataFrame with a scalar comparison

data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [90]:
# assigning values to locations where values are less than 5

data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame with loc and iloc

Like Series, DataFrame has special attributes **loc** and **iloc** for label-based and
integer-based indexing, respectively. Since DataFrame is two-dimensional, you can
select a subset of the rows and columns with NumPy-like notation using either axis
labels (loc) or integers (iloc).

In [91]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
# locate the row labeled as "Colorado"
data.loc["Colorado"]

#The result of selecting a single row is a Series with an index that contains the DataFrame’s column labels.

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [93]:
#To select multiple roles, creating a new DataFrame, pass a sequence of labels

data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [94]:
# we can combine both row and column selection in loc by separating the selections with a comma

data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [95]:
# using iloc similarly

data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [96]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    4    5      6     7

In [97]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [98]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [99]:
# Both loc and iloc indexing functions work with slices in addition to single labels or lists of labels

data.loc[:"Utah", "two"]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [100]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [101]:
# Boolean arrays can be used with loc but not iloc
data.loc[data.three >= 2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Integer indexing pitfalls

In [102]:
# Working with pandas objects indexed by integers can be a stumbling block for new
# users since they work differently from built-in Python data structures like lists and
# tuples. 

#For example, you might not expect the following code to generate an error

ser = pd.Series(np.arange(3.))
print(ser,'\n')

#ser[-1]

0    0.0
1    1.0
2    2.0
dtype: float64

In [103]:
# On the other hand, with a noninteger index, there is no such ambiguity:

ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
print(ser2,'\n')

#ser2[-1]
# FutureWarning: Series.__getitem__ treating keys as positions is deprecated. 
# In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). 
# To access a value by position, use `ser.iloc[pos]`
# August 26, 2024


ser2.iloc[-1]

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [104]:
# If you have an axis index containing integers, data selection will always be label
#oriented.If we use loc (for labels) or iloc (for integers), we will get
#exactly what you want:

ser.iloc[-1]

2.0

In [105]:
# slicing with integers is always integer oriented

ser[:2]

0    0.0
1    1.0
dtype: float64

#### Pitfalls with chained indexing`

indexing attributes can also be used to modify
DataFrame objects in place, but doing so requires some care

In [106]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [108]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [109]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [110]:
# A common gotcha for new pandas users is to chain selections when assigning, like this:

#data.loc[data.three == 5]["three"] = 6
# SettingWithCopyWarning: A value is trying to be set on a copy of a slice from a DataFrame.
#Try using .loc[row_indexer,col_indexer] = value instead
# August 26, 2024

data.loc[data["three"] == 5,"three"] = 6

data

          one  two  three  four
Ohio        1    1      2     3
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

### Arithmetic and Data Alignment

pandas can make it much simpler to work with objects that have different indexes.

Table 5-5. Flexible arithmetic methods

In [111]:
# For example, when we add objects, if any index pairs are not the same, the respective
# index in the result will be the union of the index pairs

s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
print(s1,'\n')
print(s2,'\n')
print(s1+s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [112]:
# In the case of DataFrame, alignment is performed on both rows and columns

df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
print(df1,'\n')
print(df2,'\n')
print(df1+df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [113]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
print(df1,'\n')
print(df2,'\n')
print(df1+df2)

   A
0  1
1  2

   B
0  3
1  4

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [114]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df2.loc[1, "b"] = np.nan

print(df1,'\n')
print(df2,'\n')
print(df1+df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [115]:
# Using the add method on df1, we pass df2 and an argument to fill_value, which
#substitutes the passed value for any missing values in the operation

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
# See Table 5-5 for a listing of Series and DataFrame methods for arithmetic. 
# Each has # a counterpart, starting with the letter r, that has arguments reversed. 
# So these two statements are equivalent:

1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [117]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [118]:
# when reindexing a Series or DataFrame, you can also specify a different fill value
print(df1,'\n')
print(df2,'\n')

df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

As with NumPy arrays of different dimensions, arithmetic between DataFrame and
Series is also defined.

In [119]:
# When we subtract arr[0] from arr, the subtraction is performed once for each row.
# This is referred to as broadcasting

arr = np.arange(12.).reshape((3, 4))
print(arr,'\n')
print(arr[0],'\n')
arr - arr[0]

[[ 0.  1.  2.  3.]
 [ 4.  5.  6.  7.]
 [ 8.  9. 10. 11.]]

[0. 1. 2. 3.]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [120]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

print(frame,'\n')
print(series,'\n')
print(frame-series)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [121]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
print(series2,'\n')
print(frame,'\n')
frame + series2

b    0
e    1
f    2
dtype: int64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [122]:
# If you want to broadcast over the columns, matching on the rows, we have to
#use one of the arithmetic methods and specify to match over the index.

series3 = frame["d"]

print(frame,'\n')
print(series3,'\n')

frame.sub(series3, axis="index") # subtract series3 from each column of frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects

In [123]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
print(frame,'\n')
np.abs(frame)

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [124]:
# Another frequent operation is applying a function on one-dimensional arrays to each
#column or row. DataFrame’s apply method does exactly this:

# In this example, the function f, which computes the difference between the maximum and
# minimum of a Series, is invoked once on each column in frame. The result is a Series
# having the columns of frame as its index

def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [125]:
# If we pass axis="columns" to apply, the function will be invoked once per row instead.

frame.apply(f1, axis="columns")

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [126]:
# The function passed to apply need not return a scalar value; it can also return a Series with multiple values

def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [127]:
# Element-wise Python functions can be used, too. Suppose you wanted to compute
# a formatted string from each floating-point value in frame. You can do this with
# applymap:

def my_format(x):
    return f"{x:.2f}"

#frame.applymap(my_format)
# The reason for the name applymap is that Series has a map method for applying an
# element-wise function

#FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
# August 26 2024

frame.map(my_format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [128]:
frame["e"].map(my_format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and Ranking

#### Sorting

In [129]:
# to sort lexicographically by row or column label, use the sort_index method, which returns
# a new, sorted object

obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
print(obj,'\n')

obj.sort_index()

d    0
a    1
b    2
c    3
dtype: int64

a    1
b    2
c    3
d    0
dtype: int64

In [130]:
# when sorting a DataFrame, we can sort by index or columns

frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
print(frame,'\n')

# sort by index
print(frame.sort_index(),'\n')

# sort along column
print(frame.sort_index(axis="columns"),'\n')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [131]:
# The data is sorted in ascending order by default, but can be sorted in descending order too:

frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [132]:
# The sort_values method sort a Series by its values:

obj = pd.Series([4, 7, -3, 2])

obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [133]:
# Any missing values are sorted to the end of the Series by default

obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [134]:
# Missing values can be sorted to the start instead by using the na_position option

obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [135]:
# When sorting a DataFrame, you can use the data in one or more columns as the sort keys. 
# To do so, pass one or more column names to sort_values

# In this example, we sort rows by the value of column b

frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
print(frame,'\n')
print(frame.sort_values("b"),'\n')

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [136]:
# In this example, we sort rows by the values of a, and then by the values of b

frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

#### Ranking

Table 5-6. Tie-breaking methods with rank

In [137]:
# Ranking assigns ranks from one through the number of valid data points in an array,
# starting from the lowest value. The rank methods for Series and DataFrame are the
# place to look; by default, rank breaks ties by assigning each group the mean rank

obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [138]:
# Ranks can also be assigned according to the order in which they’re observed in the data:

obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [139]:
# rank in descending order

obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [140]:
# DataFrame can compute ranks over the rows or the columns

frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
print(frame,'\n')

# rank over columns
print(frame.rank(axis="columns"),'\n')

# rank over rows
print(frame.rank(axis="rows"),'\n')

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

### Axis Indexes with Duplicate Labels

In [141]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [142]:
# use the index.is_unique method to find out if the index has duplicated labels
obj.index.is_unique

False

In [143]:
# Data selection is one of the main things that behaves differently with duplicates.
# Indexing a label with multiple entries returns a Series, while single entries return a
# scalar value:

# return a Series whose labels are "a"
print(obj["a"],'\n')

# return a scalar value whose label is "c"
print(obj["c"])

a    0
a    1
dtype: int64

4

In [144]:
# The same logic extends to indexing rows (or columns) in a DataFrame

df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

print(df,'\n')

print(df.loc["b"],'\n')

print(df.loc["c"],'\n')

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228
c -0.577087  0.124121  0.302614

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

0   -0.577087
1    0.124121
2    0.302614
Name: c, dtype: float64

## 5.3 Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods.
Most of these fall into the category of reductions or summary statistics, methods
that extract a single value (like the sum or mean) from a Series, or a Series of values
from the rows or columns of a DataFrame. Compared with the similar methods
found on NumPy arrays, they have built-in handling for missing data.

Table 5-7 is a list of common options for each reduction method

Table 5-8 is a full list of summary statistics and related methods

In [145]:
# a dataframe with missing data

df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [146]:
# Calling DataFrame’s sum method returns a Series containing column sums

df.sum()

one    9.25
two   -5.80
dtype: float64

In [147]:
# Passing axis="columns" or axis=1 sums across the columns instead:

df.sum(axis="columns")

# When an entire row or column contains all NA values, the sum is 0.

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [148]:
# the skipna option can disable the default NaN processing method

df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [149]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [150]:
# Some aggregations, like mean, require at least one non-NA value to yield a value result
# in this example, row 'c' is all NaN. Therefore, the mean cannot be calcualted, yielding a result of NaN

df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [151]:
# idxmin and idxmax, return indirect statistics, 
# like the index value where the minimum or maximum values are attained

df.idxmax()

one    b
two    d
dtype: object

In [152]:
# Some methods are cumulative, like sumsum

df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [153]:
# Some methods are neither reductions nor accumulations. 
# describe is one such example, producing multiple summary statistics in one shot:

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [154]:
# On nonnumeric data, describe produces alternative summary statistics

obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [155]:
price = pd.read_pickle("examples/yahoo_price.pkl")
print(price)

returns = price.pct_change() # call pct_change method to attain return (rate)
returns.tail() # display the result of the last five

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [156]:
# correlation between MSTF's return and IBM's return

returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [157]:
# corvariance between MSTF's return and IBM's return

returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [158]:
# DataFrame’s corr can return a full correlation matrix as a DataFrame

returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [159]:
# DataFrame’s cov can return a full covariance matrix as a DataFrame

returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [160]:
# Using DataFrame’s corrwith method, you can compute pair-wise correlations 
# between a DataFrame’s columns or rows with another Series or DataFrame

returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [161]:
# Passing a DataFrame computes the correlations of matching column names
# this example calculate the correlation between a company's stock raturn and its stock volume

volume = pd.read_pickle("examples/yahoo_volume.pkl")

returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### Unique Values, Value Counts, and Membership

Table 5-9 Unique, value counts, and set membership methods

In [162]:
obj = pd.Series(["c", "a", "d", "a", "c", "b", "b", "c", "c"])

In [163]:
# The unique method gives an array of unique values in a Series

uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [164]:
# The value_count method computes a Series containing value frequencies:

obj.value_counts()

c    4
a    2
b    2
d    1
Name: count, dtype: int64

In [165]:
# The Series is sorted by value in descending order as a convenience. value_counts is
# also available as a top-level pandas method that can be used with NumPy arrays or
# other Python sequences:

#pd.value_counts(obj.to_numpy(), sort=False)
#FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
# August 26. 2024

pd.Series(obj.to_numpy()).value_counts(sort=False)

c    4
a    2
d    1
b    2
Name: count, dtype: int64

In [166]:
# isin performs a vectorized set membership check and can be useful in filtering a
#dataset down to a subset of values in a Series or column in a DataFrame

print(obj)

mask = obj.isin(["b", "c"])
print(mask)

obj[mask] # extract elements that belong to the set {"b", "c"}

0    c
1    a
2    d
3    a
4    c
5    b
6    b
7    c
8    c
dtype: object
0     True
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
dtype: bool

0    c
4    c
5    b
6    b
7    c
8    c
dtype: object

In [167]:
# Index.get_indexer method, which gives you an index array from an array of possibly 
# nondistinct values into another array of distinct values

to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2])

In [168]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [169]:
# compute the frequency for a single column:

data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [170]:
# To compute this for all columns, pass pandas.value_counts to the DataFrame’s apply method

#result = data.apply(pd.value_counts).fillna(0) # pandas.apply(fun) apply a function along an axis.
#FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. 
#Use pd.Series(obj).value_counts() instead.
# August 26, 2024

result = data.apply(lambda col: col.value_counts()).fillna(0)

result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [171]:
# There is also a DataFrame.value_counts method, but it computes counts considering
# each row of the DataFrame as a tuple to determine the number of occurrences of each
# distinct row

data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
print(data)

data.value_counts()

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64